Config/InformationRegisters/ExternalSystemIntegrationLogs.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ExternalSystemIntegrationLogs</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Request</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Response</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ExternalSystem</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExternalSystemInteractions</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>FunctionName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>EventType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ExternalSystemEventTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ExternalSystemEventTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ExternalSystemEventTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Warning</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Error</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Success</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Info</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/HTTPServices/JCCSmart/Ext/Module.bsl
#Region EventHandlers

// ----------------------------------------------------------------------------
Function CallbackPOST(pRequest)
	vResponseCode = 200;
	vMessage = ""; 
	
	vAuthorization = pRequest.Headers["Authorization"]; 
	
	vAPPId = "";
	vRequestSignatureBase64String = "";
	vNonce = "";
	vRequestTimeStamp = "";
	
	If GetParametersFromByHeaders(vAuthorization, vAPPId, vRequestSignatureBase64String, vNonce, vRequestTimeStamp) Then 
		vExternalSystemInteraction = cmGetInteractionByID(vAPPId); 
		If ValueIsFilled(vExternalSystemInteraction) Then
			vJSON = pRequest.GetBodyAsString(); 	
			If vAuthorization = GetAuthorization(vExternalSystemInteraction, pRequest.HTTPMethod, pRequest.BaseURL, vJSON, vNonce, vRequestTimeStamp) Then
				If ValueIsFilled(vJSON) Then
					Try           
						vPaymentInfoMap = Catalogs.DataConvertationRules.JSONtoMap(vJSON);
						If vPaymentInfoMap <> Undefined Then
							cmWritePaymentExternalFOSystem(TrimAll(vExternalSystemInteraction.Hotel.Code), "", XMLValue(Type("Date"), vPaymentInfoMap["TransactionTimeStamp"]), vExternalSystemInteraction.InteractionID,
														   "", cmGetDocumentNumberFromPresentation(vPaymentInfoMap["InvoiceId"], vExternalSystemInteraction.Hotel), "", TrimAll(vExternalSystemInteraction.PaymentMethod.Code), 
														   TrimAll(vExternalSystemInteraction.Currency.Code), vPaymentInfoMap["TransactionAmount"], "", vPaymentInfoMap["TransactionAuthorization"],,,, Format(vPaymentInfoMap["TransactionNo"], "NFD=0; NZ=0; NG=0"));
						EndIf;
					Except 
						vMessage = BriefErrorDescription(ErrorInfo());
						vResponseCode = 404;
					EndTry;	
				Else
					vMessage = NStr("en = 'Empty request'; de = 'Leere Anfrage'; ru = 'Пустой запрос'");
					vResponseCode = 400;	
				EndIf;
			Else	      
				vMessage = NStr("en = 'The request was not authenticated'; de = 'Die Anfrage wurde nicht authentifiziert'; ru = 'Запрос не был аутентифицирован'");
				vResponseCode = 400;	
			EndIf;
			If vExternalSystemInteraction.DebugMode Or vResponseCode <> 200 Then 
				InformationRegisters.ExternalSystemIntegrationLogs.WriteLog(vExternalSystemInteraction, "Callback", ?(vResponseCode <> 200, Enums.ExternalSystemEventTypes.Error, Enums.ExternalSystemEventTypes.Info), vJSON, "", vMessage); 
			EndIf;
		Else
			vResponseCode = 401;
			vMessage = Nstr("en = 'Failed to find interaction parameters'; de = 'Interaktionsparameter konnten nicht gefunden werden'; ru = 'Не удалось найти параметры взаимодействия'");
			WriteLogEvent("JCCSmart.Callback", EventLogLevel.Error,,, vMessage);
		EndIf;
	Else
		vResponseCode = 401;
		vMessage = Nstr("en = 'Failed to find interaction parameters'; de = 'Interaktionsparameter konnten nicht gefunden werden'; ru = 'Не удалось найти параметры взаимодействия'");
		WriteLogEvent("JCCSmart.Callback", EventLogLevel.Error,,, vMessage);
	EndIf;
	Return New HTTPServiceResponse(vResponseCode);
EndFunction // CallbackPOST

#EndRegion

#Region Private

// ----------------------------------------------------------------------------
Function GetParametersFromByHeaders(pAuthorization, pAPPId, pRequestSignatureBase64String, pNonce, pRequestTimeStamp)
	vResult = False;
	If pAuthorization <> Undefined Then
		vAuthorizationArr = StrSplit(StrReplace(pAuthorization, "hmacauth ", ""), ":", False);
		If vAuthorizationArr.Count() = 4 Then
			pAPPId							= vAuthorizationArr[0];
			pRequestSignatureBase64String	= vAuthorizationArr[1];
			pNonce							= vAuthorizationArr[2];
			pRequestTimeStamp				= vAuthorizationArr[3];
			vResult = True;
		EndIf;
	EndIf; 
	Return vResult;
EndFunction // GetParametersFromByAuthorization

// ----------------------------------------------------------------------------
Function GetAuthorization(pExternalSystemInteraction, pHTTPMethod, pBaseURL, pBody, pNonce, pRequestTimeStamp)
	vContentBase64 = ""; 
	
	If ValueIsFilled(pBody) Then	
		vContentBase64 = Base64String(tcCryptography.Hash(pBody, HashFunction.MD5)); 
	EndIf;	  
	
	vSignature = StrTemplate("%1%2%3%4%5%6", TrimAll(pExternalSystemInteraction.InteractionID), pHTTPMethod, pBaseURL, pRequestTimeStamp, pNonce, vContentBase64); 
	vSignatureBinaryData = tcCryptography.HMAC(TrimAll(pExternalSystemInteraction.OAuth_ClientSecret), vSignature, HashFunction.SHA256);
	If vSignatureBinaryData = Undefined Then
		Return Undefined;	
	Endif; 
	
	Return StrTemplate("hmacauth %1:%2:%3:%4", TrimAll(pExternalSystemInteraction.InteractionID), Base64String(vSignatureBinaryData), pNonce, pRequestTimeStamp);
EndFunction // GetAuthorization

#EndRegion
